In [1]:
import pandas as pd 
from datasets import load_dataset
import matplotlib.pyplot as plt

ds = load_dataset('lukebarousse/data_jobs')
df = ds['train'].to_pandas()

df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

/opt/anaconda3/envs/python_course/lib/python3.11/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [2]:
df_altered = df.copy()

In [4]:
median = df_altered['salary_year_avg'].median()

df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median)

df_altered.loc[:5, ['salary_year_avg']]

   salary_year_avg
0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
5         115000.0

In [5]:
df.loc[:5, ['salary_year_avg']]

   salary_year_avg
0              NaN
1              NaN
2              NaN
3              NaN
4              NaN
5              NaN